# Premiers pas avec Pandas
Pandas est la principale librairie Python pour faire de l'analyse de données. Elle n'est pas native en Python, il faut l'installer au préalable.
Si vous ne l'avez pas encore installée avez pas

## Installer Pandas
Ouvrez votre terminal et faites `pip install pandas` ou `conda install pandas`

Vous pouvez également l'installer depuis le noteook en faisant `!pip install pandas`

## Importer Pandas
Pour importer la librairie Pandas if suffit de faire ceci ```import pandas```. Il est plus courant de le faire comme ceci avec un alias ```import pandas as pd``` et c'est cette seconde manière que je vous recommande.

In [1]:
import pandas as pd

## pandas.Series
Les listes trouvent leurs limites lorsqu'il s'agit de faire des analyses statistiques, il est certe possible d'avoir les indicateurs minimum et maximun mais il n'est pas possible de connaitre la moyenne ou l'écart-type par exemple.
L'objet pandas.Series nous permet de nous affranchir de ces limites, il est donc possible de calculer les indicateurs statistiques sur les données à svaoir la moyenne, la variance entre autres.

In [2]:
names = ["Esso", "Lendjina", "Yemi", "Adboul", "Tracy", "Adjo", "Yacuba", "Degnon"]
countries = ["Togo", "Haïti", "Nigeria", "Burkina", "Ivory Cost", "Togo", "Niger", "Benin"]
sexes = ['M', 'F', 'M', 'M', 'F', 'F', 'F', 'F']
ages = [22, 18, 20,19, 31, 23, 26, 17]
heights = [1.73, 1.43, 1.52, 1.82, 1.45, 1.61, 1.90, 1.52]

### Statistique descriptive
La statistique descriptive est une branche de la Statistique, elle <br>
Nous pouvons calculer des indicateurs sur ces données, ce qui n'est pas possible avec les listes natives en python

In [3]:
pd_ages = pd.Series(ages) # convert list into a pandas.Series

In [4]:
mean = pd_ages.mean() # Moyenne
median = pd_ages.median() # Médiane
variance = pd_ages.var(ddof=0) # Variancce
no_biais_variance = pd_ages.var() # Variance non biasée
pd_ages.std(ddof=0) # Écart-tye
pd_ages.std() # Écart-tye non biaisé

4.65985898008574

In [5]:
pd_heights = pd.Series(heights)

## pandas.DataFrame
Les limites trouvent leurs limites lorsqu'il s'agit de faire des analyses statistiques, il est certes possible d'avoir les minimum et maximun mais il n'est pas possible de connaitre la moyenne par exemple
L'objet pandas.Series nous permet de nous affranchir de ces limites, il est donc possible de calculer les indicateurs statistiques sur les données à svaoir la moyenne, la variance entre autres.

In [6]:
data = pd.DataFrame({"name": names, "country": countries, "sex": sexes, "age": ages, "height": heights})
data # show the table

       name     country sex  age  height
0      Esso        Togo   M   22    1.73
1  Lendjina       Haïti   F   18    1.43
2      Yemi     Nigeria   M   20    1.52
3    Adboul     Burkina   M   19    1.82
4     Tracy  Ivory Cost   F   31    1.45
5      Adjo        Togo   F   23    1.61
6    Yacuba       Niger   F   26    1.90
7    Degnon       Benin   F   17    1.52

In [7]:
data.describe()

             age    height
count   8.000000  8.000000
mean   22.000000  1.622500
std     4.659859  0.175479
min    17.000000  1.430000
25%    18.750000  1.502500
50%    21.000000  1.565000
75%    23.750000  1.752500
max    31.000000  1.900000

#### Afficher les 4 premières lignes du tableau

In [8]:
data.head(n=4)

       name  country sex  age  height
0      Esso     Togo   M   22    1.73
1  Lendjina    Haïti   F   18    1.43
2      Yemi  Nigeria   M   20    1.52
3    Adboul  Burkina   M   19    1.82

#### Afficher les 4 dernières lignes du tableau

In [9]:
data.tail(n=4)

     name     country sex  age  height
4   Tracy  Ivory Cost   F   31    1.45
5    Adjo        Togo   F   23    1.61
6  Yacuba       Niger   F   26    1.90
7  Degnon       Benin   F   17    1.52

#### Afficher 4 lignes du tableau choisies au hazard

In [10]:
data.sample(n=4)

       name country sex  age  height
0      Esso    Togo   M   22    1.73
1  Lendjina   Haïti   F   18    1.43
7    Degnon   Benin   F   17    1.52
5      Adjo    Togo   F   23    1.61

## Importer des données
En général, les données sur lesquelles l'on souhaite travailler sont stockées dans un fichier externe, la libraire Pandas permet d'importer des données depuis un fichier externe. Plusieurs extensions de fichiers sont prises en charge par Pandas, à savoir `.csv` le plus utilisé, `.excel`, `.pickle` ou encore `.json`

In [13]:
dt = pd.read_csv('datasets/StudentsPerformance.xls')
dt.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## Exporter des données

In [ ]:
dt.to_csv("backups/")